{"id":77,"date":"2016-12-11T06:42:46","date_gmt":"2016-12-11T06:42:46","guid":{"rendered":"https:\/\/jannah.tielabs.com\/jannah-tech\/?page_id=77"},"modified":"2020-12-20T16:24:47","modified_gmt":"2020-12-20T16:24:47","slug":"terms-of-use","status":"publish","type":"page","link":"https:\/\/jannah.tielabs.com\/tech\/terms-of-use\/","title":{"rendered":"Terms of Use"},"content":{"rendered":"\n<p>Your privacy is very important to us. At TieLabs Technologies FZE we have a few fundamental principles that we follow:<\/p>\n\n\n\n<ul><li>We don’t ask you for personal information unless we truly need it.<\/li><li>We don’t share your personal information with anyone except to comply with the law, develop our products, or protect our rights.<\/li><li>We don’t store personal information on our servers unless required for the on-going operation of our site.<\/li><\/ul>\n\n\n\n<p>TieLabs Technologies FZE (“TieLabs Technologies FZE”) operates several websites. It is TieLabs Technologies FZE’ policy to respect your privacy regarding any information we may collect while operating our websites.<\/p>\n\n\n\n<p><strong>Website Visitors<\/strong><\/p>\n\n\n\n<p>Like most website operators, TieLabs Technologies FZE collects non-personally-identifying information of the sort that web browsers and servers typically make available, such as the browser type, language preference, referring site, and the date and time of each visitor request. TieLabs Technologies FZE’ purpose in collecting non-personally identifying information is to better understand how TieLabs Technologies FZE’ visitors use its website. From time to time, TieLabs Technologies FZE may release non-personally-identifying information in the aggregate, e.g., by publishing a report on trends in the usage of its website.<\/p>\n\n\n\n<p>TieLabs Technologies FZE also collects potentially personally-identifying information like Internet Protocol (IP) addresses for logged in users and for users leaving comments on our blogs. TieLabs Technologies FZE only discloses logged in user and commenter IP addresses under the same circumstances that it uses and discloses personally-identifying information as described below, except that blog commenter IP addresses are visible and disclosed to the administrators of the blog where the comment was left.<\/p>\n\n\n\n<p><strong>Gathering of Personally-Identifying Information<\/strong><\/p>\n\n\n\n<p>Certain visitors to TieLabs Technologies FZE’ websites choose to interact with TieLabs Technologies FZE in ways that require TieLabs Technologies FZE to gather personally-identifying information. The amount and type of information that TieLabs Technologies FZE gathers depends on the nature of the interaction. For example, we ask visitors who comment on our blog to provide a username and email address. Those who wish to receive TieLabs Technologies FZE updates via email, we collect their emails. In each case, TieLabs Technologies FZE collects such information only insofar as is necessary or appropriate to fulfill the purpose of the visitor’s interaction with TieLabs Technologies FZE. TieLabs Technologies FZE does not disclose personally-identifying information other than as described below. And visitors can always refuse to supply personally-identifying information, with the caveat that it may prevent them from engaging in certain website-related activities.<\/p>\n\n\n\n<p><strong>Aggregated Statistics<\/strong><\/p>\n\n\n\n<p>TieLabs Technologies FZE may collect statistics about the behavior of visitors to its websites. For instance, TieLabs Technologies FZE may monitor the most popular pages on the our site or use spam screened by the Akismet service to help identify spam. TieLabs Technologies FZE may display this information publicly or provide it to others. However, TieLabs Technologies FZE does not disclose personally-identifying information other than as described below.<\/p>\n\n\n\n<p><strong>Protection of Certain Personally-Identifying Information<\/strong><\/p>\n\n\n\n<p>TieLabs Technologies FZE discloses potentially personally-identifying and personally-identifying information only to those of its employees, contractors and affiliated organizations that (i) need to know that information in order to process it on TieLabs Technologies FZE’ behalf or to provide services available at TieLabs Technologies FZE’ websites, and (ii) have agreed not to disclose it to others. Some of those employees, contractors and affiliated organizations may be located outside of your home country; by using TieLabs Technologies FZE’ websites, you consent to the transfer of such information to them. TieLabs Technologies FZE will not rent or sell potentially personally-identifying and personally-identifying information to anyone. Other than to its employees, contractors and affiliated organizations, as described above, TieLabs Technologies FZE discloses potentially personally-identifying and personally-identifying information only in response to a subpoena, court order or other governmental request, or when TieLabs Technologies FZE believes in good faith that disclosure is reasonably necessary to protect the property or rights of TieLabs Technologies FZE, third parties or the public at large. If you are a registered user of an TieLabs Technologies FZE website and have supplied your email address, TieLabs Technologies FZE may occasionally send you an email to tell you about new features, solicit your feedback, or just keep you up to date with what’s going on with TieLabs Technologies FZE and our products. We primarily use our various product blogs to communicate this type of information, so we expect to keep this type of email to a minimum. If you send us a request (for example via a support email or via one of our feedback mechanisms), we reserve the right to publish it in order to help us clarify or respond to your request or to help us support other users. TieLabs Technologies FZE takes all measures reasonably necessary to protect against the unauthorized access, use, alteration or destruction of potentially personally-identifying and personally-identifying information.<\/p>\n\n\n\n<p><strong>Cookies<\/strong><\/p>\n\n\n\n<p>A cookie is a string of information that a website stores on a visitor’s computer, and that the visitor’s browser provides to the website each time the visitor returns. TieLabs Technologies FZE uses cookies to help TieLabs Technologies FZE identify and track visitors, their usage of the TieLabs Technologies FZE website, and their website access preferences. TieLabs Technologies FZE visitors who do not wish to have cookies placed on their computers should set their browsers to refuse cookies before using TieLabs Technologies FZE’ websites, with the drawback that certain features of TieLabs Technologies FZE’ websites may not function properly without the aid of cookies.<\/p>\n\n\n\n<p><strong>Business Transfers<\/strong><\/p>\n\n\n\n<p>If TieLabs Technologies FZE, or substantially all of its assets were acquired, or in the unlikely event that TieLabs Technologies FZE goes out of business or enters bankruptcy, user information would be one of the assets that is transferred or acquired by a third party. You acknowledge that such transfers may occur, and that any acquirer of TieLabs Technologies FZE may continue to use your personal information as set forth in this policy.<\/p>\n\n\n\n<p><strong>Ads<\/strong><\/p>\n\n\n\n<p>Ads appearing on any of our websites may be delivered to users by advertising partners, who may set cookies. These cookies allow the ad server to recognize your computer each time they send you an online advertisement to compile information about you or others who use your computer. This information allows ad networks to, among other things, deliver targeted advertisements that they believe will be of most interest to you. This Privacy Policy covers the use of cookies by TieLabs Technologies FZE and does not cover the use of cookies by any advertisers.<\/p>\n\n\n\n<p><strong>Comments<\/strong><\/p>\n\n\n\n<p>Comments and other content submitted to Disqus anti-spam service are not saved on our servers unless they were marked as false positives, in which case we store them long enough to use them to improve the service to avoid future false positives.<\/p>\n\n\n\n<p><strong>Privacy Policy Changes<\/strong><\/p>\n\n\n\n<p>Although most changes are likely to be minor, TieLabs Technologies FZE may change its Privacy Policy from time to time, and at TieLabs Technologies FZE’ sole discretion. TieLabs Technologies FZE encourages visitors to frequently check this page for any changes to its Privacy Policy. Your continued use of this site after any change in this Privacy Policy will constitute your acceptance of such change.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Your privacy is very important to us. At TieLabs Technologies FZE we have a few fundamental principles that we follow: We don’t ask you for personal information unless we truly need it.We don’t share your personal information with anyone except to comply with the law, develop our products, or protect our rights.We don’t store personal &hellip;<\/p>\n","protected":false},"author":18,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"amp_validity":null,"amp_enabled":true,"_links":{"self":[{"href":"https:\/\/jannah.tielabs.com\/tech\/wp-json\/wp\/v2\/pages\/77"}],"collection":[{"href":"https:\/\/jannah.tielabs.com\/tech\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/jannah.tielabs.com\/tech\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/jannah.tielabs.com\/tech\/wp-json\/wp\/v2\/users\/18"}],"replies":[{"embeddable":true,"href":"https:\/\/jannah.tielabs.com\/tech\/wp-json\/wp\/v2\/comments?post=77"}],"version-history":[{"count":0,"href":"https:\/\/jannah.tielabs.com\/tech\/wp-json\/wp\/v2\/pages\/77\/revisions"}],"wp:attachment":[{"href":"https:\/\/jannah.tielabs.com\/tech\/wp-json\/wp\/v2\/media?parent=77"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}